Core/src/DataProcessors/ПомощникЗагрузкиБанковскойВыписки/ПомощникЗагрузкиБанковскойВыписки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникЗагрузкиБанковскойВыписки</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбменаСИнтернетБанком</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВыписки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТранзакцийБВ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанк</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКазначейство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетКорр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_ШаблонЗаполнения</name>
      <type>
        <types>CatalogRef.ШаблоныЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>_СсылкаНаДокумент</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ПеремещениеДС</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
      </type>
    </attributes>
    <attributes>
      <name>_РасшифрокаTransactionType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_РасшифрокаStatusCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанкКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанкДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент1С</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента1С</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Подотчетник1С</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийПоступлениеНаСчет/ВидыОперацийПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеНаСчет</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоКартам</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличными</name>
  </enumValues>
  <enumValues>
    <name>ПереводСДругогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ОтКурьерскойКомпанииПочты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенегОтСотрудника</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийРасходСоСчета/ВидыОперацийРасходСоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходСоСчета</name>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежныеКарты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличных</name>
  </enumValues>
  <enumValues>
    <name>ПереводНаДругойСчет</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВРазрезеСотрудников</name>
    <comment>// Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>ПенсионномуФонду</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыДенежныхСредств/ТипыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасходнаяНакладнаяНаличные</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасходнаяНакладнаяБезналичные</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>ОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Сотрудники</owners>
  <owners>Catalog.КодыКазначейства</owners>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкРасчетов</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКорреспондента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыводаМесяца</name>
    <type>
      <types>EnumRef.ВариантыВыводаМесяцаВДатеДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезКопеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУказанияКПП</name>
    <type>
      <types>EnumRef.ВариантыУказанияКПП</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/DataProcessors/ПомощникЗагрузкиБанковскойВыписки/ObjectModule.bsl
&НаСервере
Процедура СоздатьДокументы()Экспорт
	
	СтруктураОтбора  = Новый Структура; 
	СтруктураОтбора.Вставить("_Загружать", Истина); 
	МассивДанных = ТаблицаВыписки.Выгрузить(СтруктураОтбора);
	Для Каждого стрДанные Из МассивДанных Цикл 
		Если ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения) И Не ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент) Тогда 
			СоздатьДокументПоДанным(стрДанные);
		ИначеЕсли НЕ ЗначениеЗаполнено(стрДанные._ШаблонЗаполнения)Тогда 
			Сообщить(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' სტრიქონზე არ არის შვესებული შევსების წესი'; ka = ' სტრიქონზე არ არის შვესებული ""შევსების წესი""'"));
		ИначеЕсли ЗначениеЗаполнено(стрДанные._СсылкаНаДокумент)Тогда 
			Сообщить(Строка(стрДанные.НомерСтроки) + НСтр("ru = ' დოკუმენტი უკვე შექმნილია'; ka = ' დოკუმენტი უკვე შექმნილია'"));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументПоДанным(Данные)Экспорт
	текШаблонЗаполнения =  Данные._ШаблонЗаполнения;
	
	этоПеремещениеДС = текШаблонЗаполнения.СсылкаИсточника = "ПеремещениеДС";
	
	ЗаполнитьВидОперации = 	не этоПеремещениеДС;
	
	ЗаполнитьКонтрагент = текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя 
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам//Паганини
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю	
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику;
	
	ЗаполнитьПодотчетник=  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику;

	ЗаполнитьВидНалога =  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги;
	
	ЗаполнитьКорреспонденция =  текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
	ИЛИ текШаблонЗаполнения.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Прочее;

	
	врСсылкаИсточника   =  текШаблонЗаполнения.СсылкаИсточника;
	
	ТекСумма = 0;
	Если Данные.СуммаКТ > 0 Тогда 	
		ТекСумма =  Данные.СуммаКТ;
	ИначеЕсли Данные.СуммаДТ > 0 Тогда
		ТекСумма =  Данные.СуммаДТ;
	КонецЕсли;
	
	новыйДокумент = Документы[врСсылкаИсточника].СоздатьДокумент();
	новыйДокумент.Дата = Данные.Дата;
	новыйДокумент.Организация = Организация;
	Если ЗаполнитьВидОперации Тогда 
		новыйДокумент.ВидОперации = текШаблонЗаполнения.ВидОперации;
	КонецЕсли;
	
	новыйДокумент.Статья = текШаблонЗаполнения.Статья;
	новыйДокумент.Автор  = Автор; 
	
	Если этоПеремещениеДС Тогда 
		
		новыйДокумент.ТипДенежныхСредств			= Перечисления.ТипыДенежныхСредств.Безналичные;
		новыйДокумент.ТипДенежныхСредствПолучатель  = Перечисления.ТипыДенежныхСредств.Безналичные;
		новыйДокумент.ВалютаДенежныхСредств			= БанковскийСчет.ВалютаДенежныхСредств;
		новыйДокумент.СуммаДокумента			    = ТекСумма;
		
		Если текШаблонЗаполнения.ТекСчетПолучатель Тогда 
			новыйДокумент.БанковскийСчетПолучатель = БанковскийСчет;
			новыйДокумент.БанковскийСчет =  Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Данные.СчетБанк);
		Иначе 
			новыйДокумент.БанковскийСчет = БанковскийСчет;
			новыйДокумент.БанковскийСчетПолучатель =  Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Данные.СчетБанк);
		КонецЕсли;
		
	Иначе 
		новыйДокумент.БанковскийСчет = БанковскийСчет;
		
		новыйДокумент.ВалютаДенежныхСредств = БанковскийСчет.ВалютаДенежныхСредств;
		Если ЗаполнитьКонтрагент Тогда
			новыйДокумент.Контрагент = Данные.Контрагент1С;
			новыйДокумент.СчетКонтрагента = Данные.СчетКонтрагента1С; 
			Если ЗначениеЗаполнено(Данные.Контрагент1С) Тогда
				новыйДокумент.НалогообложениеНДС = Данные.Контрагент1С.НалогообложениеНДС;
			Иначе
				новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
			КонецЕсли;//Паганини
		КонецЕсли;
		Если ЗаполнитьПодотчетник Тогда
			новыйДокумент.Подотчетник = Данные.Подотчетник1С;
		КонецЕсли;
		новыйДокумент.СуммаДокумента  = ТекСумма;
		
		ПересчитатьСуммыДокумента(новыйДокумент,Неопределено,1, 1);
		
		
		Если ЗаполнитьВидНалога Тогда
			новыйДокумент.ВидНалога = текШаблонЗаполнения.ВидНалога;
		КонецЕсли;
		
		Если ЗаполнитьКорреспонденция Тогда
			новыйДокумент.Корреспонденция = текШаблонЗаполнения.Корреспонденция;
			новыйДокумент.КорреспонденцияРегл = текШаблонЗаполнения.КорреспонденцияРегл;
		КонецЕсли;
		
		нстрРасшифровкаПлатежа = новыйДокумент.РасшифровкаПлатежа.Добавить();
		Если ЗаполнитьКонтрагент И текШаблонЗаполнения.ЗаполнитьДоговор Тогда
			нстрРасшифровкаПлатежа.Договор = НайтиДоговорКонтрагентаПоВалюте(новыйДокумент.Контрагент,БанковскийСчет.ВалютаДенежныхСредств);
		КонецЕсли;
		
		нстрРасшифровкаПлатежа.ПризнакАванса = текШаблонЗаполнения.ПризнакАванса; 
		нстрРасшифровкаПлатежа.СуммаПлатежа = новыйДокумент.СуммаДокумента;
		ПересчитатьСуммыДокумента(новыйДокумент,нстрРасшифровкаПлатежа,1, 1);
		
		//Паганини_
		Если ЗаполнитьКонтрагент Тогда
			Если новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			ИначеЕсли новыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			Иначе
				нстрРасшифровкаПлатежа.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
			КонецЕсли;
			нстрРасшифровкаПлатежа.СуммаНДС = нстрРасшифровкаПлатежа.СуммаПлатежа - (нстрРасшифровкаПлатежа.СуммаПлатежа) / ((нстрРасшифровкаПлатежа.СтавкаНДС.Ставка + 100) / 100);
		КонецЕсли;
		//_Паганини
		
	КонецЕсли; 
	
	новыйДокумент.НазначениеПлатежа = Данные.НазначениеПлатежа;
	новыйДокумент.Комментарий		= Данные.Комментарий;
	
	новыйДокумент.ID = Данные.ID;
	
	Попытка
		новыйДокумент.записать(РежимЗаписиДокумента.Запись);
		ТаблицаВыписки[Данные.НомерСтроки-1]._СсылкаНаДокумент = новыйДокумент.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ПересчитатьСуммыДокумента(ДокументБанк,СтрокаТабличнойЧасти,Курс, Кратность)
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("ВалютаКурсКратность",РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументБанк.Дата,	Новый Структура("Валюта", БанковскийСчет.ВалютаДенежныхСредств)));
	СтруктураДанные.Вставить("ВалютаДенежныхСредств",БанковскийСчет.ВалютаДенежныхСредств);
	
	естьПоступлениеНаСчет = ТипЗнч(ДокументБанк) = Тип("ДокументОбъект.ПоступлениеНаСчет");
	Если ЗначениеЗаполнено(ДокументБанк.ВалютаДенежныхСредств) И естьПоступлениеНаСчет Тогда
		Курс = ?(
		СтруктураДанные.ВалютаКурсКратность.Курс = 0,
		1,
		СтруктураДанные.ВалютаКурсКратность.Курс
		);
		Кратность = ?(
		СтруктураДанные.ВалютаКурсКратность.Кратность = 0,
		1,
		СтруктураДанные.ВалютаКурсКратность.Кратность
		);
		//Если ДокументБанк.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты") Тогда
		//	ДокументБанк.Курс = Курс;
		//	ДокументБанк.Кратность = Кратность;
		//КонецЕсли;
		
		ДокументБанк.Курс = ?(
		ДокументБанк.Курс = 0,
		1,
		ДокументБанк.Курс
		);
		ДокументБанк.Кратность = ?(
		ДокументБанк.Кратность = 0,
		1,
		ДокументБанк.Кратность
		);
		
		ДокументБанк.СуммаУчета = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		ДокументБанк.СуммаДокумента,
		ДокументБанк.Курс,
		Курс,
		ДокументБанк.Кратность,
		Кратность
		);

	КонецЕсли;
	
	Если Не СтрокаТабличнойЧасти = Неопределено Тогда  
		СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
		);
		СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
		);
		СтрокаТабличнойЧасти.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаПлатежа,
		Курс,
		СтрокаТабличнойЧасти.Курс,
		Кратность,
		СтрокаТабличнойЧасти.Кратность
		);
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСуммыДокумента()

Функция ПолучитьДатуИзСтроки(ДатаСтрока);
	ДатаСтрока = Лев(ДатаСтрока,10);
	
	Год   = прав(ДатаСтрока,4);
	Месяц  = Сред(ДатаСтрока,4,2);
	День = Лев(ДатаСтрока,2);
	
	Возврат Дата(Год,Месяц,День);
	
КонецФункции

Функция НайтиДоговорКонтрагентаПоВалюте(Контрагент,ВалютаДенежныхСредств)
	
	знчВозврата = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВалютаРасчетов", ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		знчВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат знчВозврата;
	
КонецФункции
